IDEA StatiCa Open Model
SectionConcreteCheckResult.SectionId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Id Of section
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int SectionId { get; set; }
Public Property SectionId As Integer
	Get
	Set
public:
property int SectionId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
SectionConcreteCheckResult Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace